SetOverwrite
Syntax
SapObject.SapModel.DesignAluminum.Eurocode_9_2007.SetOverwrite
VB6 Procedure
Function SetOverwrite(ByVal Name As String, ByVal Item As Long, ByVal Value As Double, Optional ByVal ItemType As eItemType = Object) As Long
Parameters
Name
The name of a frame object with a aluminum frame design procedure.
Item
This is an integer between 1 and 29, inclusive, indicating the overwrite item considered.
1 = Demand/capacity ratio limit
2 = Live load reduction factor
3 = Net area to total area ratio
4 = Material buckling class
5 = Unbraced length ratio, Major
6 = Unbraced length ratio, Minor
7 = Unbraced length ratio, LTB
8 = Effective length factor sway, K Major
9 = Effective length factor sway, K Minor
10 = Effective length factor, K LTB
11 = LTB fixed end
12 = Bending coefficient, C1
13 = Bending coefficient, C2
14 = Bending coefficient, C3
15 = Torsional-flexural buckling curve
16 = Buckling curve for LTB
17 = Tensile capacity, Nt,Rd
18 = Elastic torsional buckling force, NcrT
19 = Elastic torsional-flexural buckling force, NcrTF
20 = Compressive capacity, NRk
21 = Major bending capacity, MyRk
22 = Minor bending capacity, MzRk
23 = Lateral-torsional buckling moment capacity, Mcr
24 = Major shear capacity, Vy.Rd
25 = Minor shear capacity, Vz.Rd
26 = Torsion capacity, TRd
27 = Shear stress due to warping torsion moment,  τw
28 = Warping coefficient, kw
29 = Coordinate of load application, za
Value
The value of the considered overwrite item.
1 = Demand/capacity ratio limit
 Value >= 0; 0 means use program determined value.
2 = Live load reduction factor
 Value >= 0; 0 means use a program determined value.
3 = Net area to total area ratio
 Value >= 0; 0 means use program default value.
4 = Material buckling class
 0 = Program default
 1 = Class A
 2 = Class B
5 = Unbraced length ratio, Major
 Value >= 0; 0 means use program determined value.
6 = Unbraced length ratio, Minor
 Value >= 0; 0 means use program determined value.
7 = Unbraced length ratio, Lateral Torsional Buckling
 Value >= 0; 0 means use program determined value.
8 = Effective length factor, K Major
 Value >= 0; 0 means use program determined value.
9 = Effective length factor, K Minor
 Value >= 0; 0 means use program determined value.
10 = Effective length factor, K LTB
 Value >= 0; 0 means use program determined value.
11 = LTB Fixed End
 0 = Program default
 1 = Left
 2 = Right
12 = Bending coefficient, C1
 Value >= 0; 0 means use program determined value.
13 = Bending coefficient, C2
 Value >= 0; 0 means use program determined value.
14 = Bending coefficient, C3
 Value >= 0; 0 means use program determined value.
15 = Torsional-flexural buckling curve
 0 = Program default
 1 = Curve 1
 2 = Curve 2
16 = Buckling curve for LTB
 0 = Program default
 1 = Curve 1
 2 = Curve 2
17 = Tensile capacity, Nt,Rd
 Value >= 0; 0 means use program determined value. [F]
18 = Elastic torsional buckling force, NcrT
 Value >= 0; 0 means use program determined value. [F]
19 = Elastic torsional-flexural buckling force, NcrTF
 Value >= 0; 0 means use program determined value. [F]
20 = Compressive capacity, NRk
 Value >= 0; 0 means use program determined value. [F]
21 = Major bending capacity, MyRk
 Value >= 0; 0 means use program determined value. [FL]
22 = Minor bending capacity, MzRk
 Value >= 0; 0 means use program determined value. [FL]
23 = Minor bending capacity, Mcr
 Value >= 0; 0 means use program determined value. [FL]
24 = Major shear capacity, Vy.Rd
 Value >= 0; 0 means use program determined value. [F]
25 = Minor shear capacity, Vz.Rd
 Value >= 0; 0 means use program determined value. [F]
26 = Torsion capacity, TRd
 Value >= 0; 0 means use program determined value. [FL]
27 = Shear stress due to warping torsion moment,  τw
 Value >= 0; 0 means use program determined value. [F/L2]
28 = Warping coefficient, kw (used in Mcr calculation)
 0.5 =<Value =< 1; 0 means use program determined value which is defaulted to 1.0.
29 = Coordinate of load application, za (used in Mcr calculation)
ItemType
This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
If this item is Object, the assignment is made to the frame object specified by the Name item.
If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
If this item is SelectedObjects, assignment is made to all selected frame objects, and the Name item is ignored.
Remarks
This function sets the value of an aluminum design overwrite item.
The function returns zero if the item is successfully set; otherwise it returns a nonzero value.
VBA Example
Sub SetAluminumDesignOverwriteItemEurocode_9_2007()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'set aluminum design code
 ret = SapModel.DesignAluminum.SetCode("EN 1999:2007")
 'set overwrite item
 ret = SapModel.DesignAluminum.Eurocode_9_2007.SetOverwrite("8", 1, 2)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 23.3.0
See Also
GetOverwrite